{
  "slug": "devshayani-ekadasi-when-vishnu-sleeps",
  "title": "Devshayani Ekadasi: The Day God Goes to Sleep and the World Waits",
  "excerpt": "Every year, on the eleventh day of Asadha's bright fortnight, Lord Vishnu retreats to the cosmic ocean and sleeps — for four months. The universe does not fall apart. But weddings stop, auspicious beginnings pause, and millions of devotees shift into a quieter, more inward mode of living. Devshayani Ekadasi is the day the divine goes within. And invites us to follow.",
  "coverEmoji": "🌊",
  "body": [
    {
      "heading": "Vishnu's Sleep and the Cosmic Order",
      "text": "Devshayani Ekadasi — also called Ashadhi Ekadasi, Shayani Ekadasi, or Hari Shayani Ekadasi — falls on the Shukla Ekadasi of Asadha, the month in which the monsoon truly arrives in most of India. On this day, Lord Vishnu is said to retire to Kshira Sagara, the cosmic ocean of milk, and to sleep on the serpent Shesha for the four months of Chaturmas ('four months'). He awakens on Prabodhini Ekadasi in Kartik. This four-month period corresponds exactly to the monsoon season — the period when ancient India's roads became impassable due to flooding, when travel was impractical, when the earth itself seemed to withdraw into a kind of internal season. The monastic tradition aligned with this: during Chaturmas, wandering monks (parivrajakas) would stop traveling and stay in one place for four months, teaching and being taught. The concept of God's sleep was the cosmic mirror of a civilization's natural, seasonal withdrawal."
    },
    {
      "heading": "The Story of King Mandhata and the God Who Slept",
      "text": "The Padma Purana tells the story of King Mandhata, whose kingdom suffered a three-year drought. He consulted sages, performed sacrifices, gave gold to the poor — nothing worked. Finally, the sage Angiras told him: Vishnu is asleep in your region, and nothing auspicious can fully flourish while he sleeps. But you can observe the Devshayani Ekadasi with complete sincerity — fast, worship Vishnu, read the Vedas, stay awake the night — and this devotion can awaken a response even from the sleeping god. Mandhata observed the Ekadasi with his entire kingdom. Rain came. The drought broke. The teaching embedded in this story is subtle: even in periods of divine withdrawal, even when it feels as if the universe has gone quiet and your prayers are not reaching anywhere — the practice continues. You do not stop because you cannot hear a response. You observe, and you wait, and you trust that the cosmic ocean is not empty."
    },
    {
      "heading": "Chaturmas: Four Months of Inwardness",
      "text": "The Chaturmas period beginning on Devshayani Ekadasi is one of the most misunderstood aspects of the Hindu calendar. Popularly it is known primarily for its restrictions: no weddings, no major auspicious beginnings, no shaving the head, no eating certain foods (typically one category is given up for each month — leafy greens in the first month, yogurt in the second, milk in the third, dal in the fourth). But the deeper purpose is not restriction — it is redirection. Chaturmas is the tradition's built-in annual retreat: a four-month period of increased scripture study, spiritual practice, simpler living, and voluntary reduction of sensory stimulation. The restrictions are not punishments; they are invitations to simplify. In an era when the default mode is constant stimulation, constant acquisition, and constant optimization, the idea of four months deliberately spent in a quieter, more inward orientation is not archaic. It is radical."
    },
    {
      "heading": "Pandharpur and the Wari Pilgrimage",
      "text": "Devshayani Ekadasi is perhaps most magnificently observed in Maharashtra, where it marks the culmination of the Wari — the great pilgrimage to Pandharpur. Hundreds of thousands of Varkari devotees (followers of the Varkari sect, whose patron deities are Vitthal and Rakhumai at Pandharpur) walk from their home towns in long processions called Dindis, carrying palanquins bearing the footwear (paduka) of the great poet-saints Dnyaneshwar and Tukaram. They walk for weeks — singing abhangas (devotional songs) the entire way — to arrive at Pandharpur on Ashadhi Ekadasi and have darshan of Vitthal. The sight of this pilgrimage — stretching for miles, an entire river of white-clad devotees singing in unison — is one of the most moving things the Indian subcontinent produces each year. It is a democracy of devotion: farmers, teachers, merchants, laborers, all walking together, all singing the same songs, all arriving at the same door."
    },
    {
      "heading": "Observing Devshayani Ekadasi",
      "text": "The fast of Devshayani Ekadasi follows the standard Ekadasi structure: avoid grains and beans from the previous evening, wake early, bathe, worship Vishnu (or his images and Shaligram), recite Vishnu Sahasranama or the Ekadasi Mahatmya from the Padma Purana, stay awake the night in prayer and scripture. The unique element of this Ekadasi is the ritual of 'shayana' — putting Vishnu to sleep. In many temples, a special ceremony is performed where the Vishnu idol is ceremonially laid down to sleep on a bed adorned with flowers, with a prayer asking him to rest and to return in four months. It is a peculiarly intimate ritual: the devotee tucking in the god, as a parent tucks in a child. And then the four months of waiting begin — not passive waiting, but active preparation, so that when Vishnu wakes, you have not wasted the quiet."
    }
  ]
}
