{
  "slug": "prabodhini-ekadasi-when-vishnu-wakes",
  "title": "Prabodhini Ekadasi: The Morning God Opens His Eyes Again",
  "date": "February 21, 2026",
  "excerpt": "For four months, the universe has been quieter. Weddings have paused, great beginnings have waited, and devotees have spent the monsoon season in a more inward mode of living. Then comes the eleventh day of Kartik's bright fortnight — and Lord Vishnu wakes. The wedding season begins. The Tulsi plant gets married. And the world exhales.",
  "coverEmoji": "🌅",
  "body": [
    {
      "heading": "The God Who Wakes to a World Transformed",
      "text": "Prabodhini Ekadasi — also called Dev Uthani Ekadasi, Devotthan Ekadasi, or Hari Prabodhini Ekadasi — is the eleventh day of the bright fortnight of Kartik, exactly four months after Devshayani Ekadasi. On this day, Vishnu wakes from his cosmic sleep on the serpent Shesha in the ocean of milk, and with his waking, the restrictions of Chaturmas lift. The tradition describes this waking with great tenderness: Vishnu's eyes open slowly, he stretches, he receives the shankha (conch), chakra (discus), gada (mace), and padma (lotus) from Lakshmi's hands, and he surveys the earth that continued, as it always does, without him. But the earth in Kartik is different from the earth he left in Asadha. The monsoon has passed. The crops are in the fields. The air is cool and crisp and the marigolds are blooming. He wakes into the most beautiful season of the year, and the universe celebrates."
    },
    {
      "heading": "The Tulsi Vivah: The God Who Marries the Herb",
      "text": "The ritual most closely associated with Prabodhini Ekadasi — and with the days surrounding it — is Tulsi Vivah: the ceremonial wedding of the Tulsi plant to Vishnu (represented by the Shaligram stone or the image of Bal Mukund Krishna). This may seem unusual to a modern eye, but the tradition is both ancient and specific. Tulsi (Holy Basil) is considered the most beloved plant of Vishnu — the Padma Purana states that Vishnu considers a single Tulsi leaf placed on his image more precious than all other offerings combined. The story of Tulsi is itself a story of devotion, curse, and transformation: Vrinda, a devoted wife, was tricked by Vishnu, and in grief she cursed him to become a stone (hence the Shaligram). Out of guilt and love, Vishnu granted her the boon of becoming the most sacred plant in his worship. The Tulsi Vivah is the resolution of that old story — the marriage that heals an ancient wound. It is observed with full wedding ceremony: the plant is decorated as a bride, the Shaligram is dressed as a groom, the seven circumambulations are performed, and the house is filled with the smell of incense and flowers."
    },
    {
      "heading": "The Opening of the Wedding Season",
      "text": "With Vishnu's waking on Prabodhini Ekadasi, the four-month wedding moratorium lifts, and the most auspicious wedding season of the Hindu year begins. The remaining weeks of Kartik and the months of Margasira and Pausa are filled with weddings across the subcontinent. In many families, couples who became engaged during Chaturmas have been waiting specifically for this day to set their wedding date. The logic is theological but also practical: the same good auspices that govern Vishnu's waking govern all new beginnings. A union entered into with the blessing of the cosmos waking up and reopening is considered especially fortunate. In parts of North India, families who could not wait — who married during Chaturmas due to circumstances — traditionally observe a small ritual on Prabodhini Ekadasi to receive Vishnu's retroactive blessing on the union."
    },
    {
      "heading": "Sugarcane, Amla, and the Taste of Kartik",
      "text": "One of the most charming customs of Prabodhini Ekadasi involves sugarcane. The story goes that when Vishnu woke, he was thirsty and hungry after four months of sleep, and he asked for something sweet. Sugarcane was offered — and from that day, sugarcane is placed at the threshold of the home on Prabodhini Ekadasi, offered to Vishnu with prayer, and then distributed to the family and neighbors. The Amla (Indian gooseberry) is also deeply associated with Kartik — eating Amla during this month and sitting under the Amla tree is considered meritorious, and on Prabodhini Ekadasi in some traditions, the Amla tree itself is worshipped. The gooseberry — bitter and astringent but extraordinarily rich in vitamin C and Ayurvedic virtue — is the Kartik fruit in the same way that the mango is the summer fruit and the orange is the winter fruit. The season, the body, and the sacred calendar are never fully separate."
    },
    {
      "heading": "The Night of Jaagaran: Staying Awake With the Waking God",
      "text": "Just as Devshayani Ekadasi involves putting Vishnu to sleep with ceremony, Prabodhini Ekadasi involves waking him with ceremony — and then staying awake with him through the night. The practice of jaagaran (nightlong vigil) on this night is considered especially meritorious. Devotees gather in homes or temples, sing bhajans, recite Vishnu Sahasranama, listen to the Prabodhini Mahatmya from the Skanda Purana, and maintain the night in joyful wakefulness. There is a particular quality to a Prabodhini Ekadasi night that is different from other overnight observances: it carries an unmistakable sense of celebration rather than austerity. The god is awake again. The cold-season air is crisp. The lamps burn steadily. The singing goes on until the sky begins to lighten in the east — and when the first sun of Dwadasi morning appears, the fast is broken with the sweetness of sugarcane or fruits, and the new season begins in full."
    }
  ]
}
